# Pandas

* pandas use cases:
    * data transformation
    * data analysis
    * data cleaning
* pandes notations:
    * series---creating the data
    * dataframe----for making the data in a particular tabular format

In [14]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':30,'s2':20,'s3':10}
internal2=pd.Series(internal2)
print(internal2)

s1    20
s2    10
s3    30
dtype: int64
s1    30
s2    20
s3    10
dtype: int64

In [21]:
final={'internal1':internal1,'internal2':internal2}
final=pd.DataFrame(final)
final

    internal1  internal2
s1         20         30
s2         10         20
s3         30         10

In [25]:
final.columns

Index(['internal1', 'internal2'], dtype='object')

In [26]:
final.values

array([[20, 30],
       [10, 20],
       [30, 10]], dtype=int64)

In [33]:
final.values[1,1]

20

In [34]:
final.values[2]

array([30, 10], dtype=int64)

In [36]:
for i in final.values:
    print(i[0],i[1])

20 30
10 20
30 10

In [37]:
for i in final.values:
    print(i[0])

20
10
30

In [38]:
final.loc['s4']=[20,30]  #for adding new data

In [39]:
final

    internal1  internal2
s1         20         30
s2         10         20
s3         30         10
s4         20         30

In [45]:
final.drop('s4') #for delect specific data

    internal1  internal2
s1         20         30
s2         10         20
s3         12         30

In [46]:
final.values[2]=[12,30] #for changing the data at specific location
final

    internal1  internal2
s1         20         30
s2         10         20
s3         12         30
s4         20         30

In [48]:
### reading the csv files using pandas
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [49]:
income.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [50]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [51]:
income.values[1,1]

'Alaska'

In [53]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [54]:
s=0
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933

In [144]:
a=income.values[2]
a

array(['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
       48621, 47044, 50602], dtype=object)

In [147]:
income.values[2]

array(['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
       48621, 47044, 50602], dtype=object)

In [151]:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [178]:
a=income.values[1]
s=0
c=0
d=0
for i in a:
    if c==2:
        d+=1
        s+=i
    else:
        c+=1
print("avg of all years:" , s/d,c)

avg of all years: 60106.555555555555 2